package f_oop2;

public class Inheritance2 {

	public static void main(String[] args) {
		/*
		 * << 추상 메소드 >>
		 * - 구현부가 없어 선언부만 존재하는 메소드이다.
		 * - abstract 리턴타입 메소드명();
		 * - 클래스 구현에 도움을 주기 위해 사용한다.
		 * - 내용이 없는 메소드
		 * 
		 * << 추상클래스 >>
		 * - 추상메소드를 가진 클래스를 추상클래스라고 한다.
		 * - abstract class 클래스명{}
		 * - 추상클래스는 객체를 생성할 수 없고, 부모 클래스의 역할만 할 수 있다.
		 * - 클래스는 상속을 하나만 받을 수 있다. 메소드에 내용이 있을 수 있기 때문에 상속은 하나만 가능하다.
		 * 
		 * << 인터페이스 >>
		 * - 상수와 추상메소드만 멤버로 가질 수 잇는 데이터 구조이다.
		 * - interface 인터페이스명{}
		 * - 모든 멤버변수의 제어자는 public static final 이며 생략할 수 있다.
		 * - 모든 메소드의 제어자는 public abstract 이며, 생략할 수 있다.
		 * - 인터페이스는 상속과는 다르게 여러개를 받을 수 있다. 이름이 동일한 메소드가 있어도 추상메소드이기 때문에 상관이 없다.
		 * 
		 * << 내부 클래스 >>
		 * - 클래스 내부에서 선언된 클래스이다.
		 * - 선언된 위치와 형태에 따라 여러가지로 나누어진다.
		 * - 인스턴스 클래스 : 멤버변수 선언위치에 선언하며, 인스턴스 멤버들과 관련된 직업에 사용된다.
		 * - 스태틱 클래스 : static이 붙고 멤버변수 선언위치에 선언하며, static 멤버들과 관련된 작업에 사용된다.
		 * - 지역 클래스 : 메소드나 초기화블럭 안에 선언하며, 선언된 영역 내부에서만 사용될 수 있다.
		 * - 익명 클래스 : 이름이 없고, 선언과 객체 생성을 동시에 한다.(일회용)
		 *  
		 */
	}

}
